app/Controllers/OperatorController.php

    public function deleteKelas()
    {
        $id = $this->request->getPost('id');
        $delete = $this->kelas->delete($id);
---
DELETE FROM `kelas`
WHERE `id` IN ('3')

    public function siswaKelas($id)
    {
        $siswa = $this->user->getSiswaPerkelas($id);

        $kelas = $this->kelas->find($id);
---
SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '1'

    public function tambahSiswa()
    {
        $nama = $this->request->getPost('nama');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $kelas = $this->request->getPost('kelas');

        if (!$nama || !$email || !$password || !$kelas) {
            return redirect()->back()->with('error', 'Semua field harus diisi!');
        }
        $input = [
            'nama'     => trim($nama),
            'email'    => trim($email),
            'password' => password_hash(trim($password), PASSWORD_BCRYPT),
            'kelas_id'    => $kelas,
        ];

        $prosses = $this->user->insert($input);
---
INSERT INTO `users` (`nama`, `email`, `password`, `kelas_id`, `created_at`, `updated_at`) VALUES ('Udin', 'Udin@Smp1Karangkancana.com', '$2y$10$y1U.PZelUo1foIZnJntWk.GiFXjsfxmVy3EyY4pxheehlc9Iw9V9G', '1', '2025-03-19 15:19:03', '2025-03-19 15:19:03')

    public function deleteSiswa()
    {
        $id = $this->request->getPost('id');
        $delete = $this->user->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('3')

    public function editSiswa()
    {
        $id = $this->request->getPost('id');
        $input = [
            'nama' => $this->request->getPost('nama'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'kelas_id' => $this->request->getPost('kelas_id'),
        ];

        $proccess = $this->user->update($id, $input);
---
UPDATE `users` SET `nama` = 'Udin', `email` = 'Udin@Smp1Karangkancana.com', `password` = 'password', `kelas_id` = '2', `updated_at` = '2025-03-19 15:25:03'
WHERE `users`.`id` IN ('9')