app/Models/KelasModel.php

SELECT `kelas`.`id`, `kelas`.`nama`, `users`.`nama` as `wali_kelas`
FROM `kelas`
LEFT JOIN `users` ON `users`.`id`=`kelas`.`wali_kelas`
---
    public function getKelas()
    {
        return $this->select('kelas.id, kelas.nama, users.nama as wali_kelas')
            ->join('users', 'users.id=kelas.wali_kelas', 'left')
            ->findAll();