app/Models/UserModel.php

    public function getGuru()
    {
        return $this->select('*')
            ->where('role', 'Guru')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'Guru'

    public function getSiswaPerkelas($id)
    {
        return $this->select('users.nama,users.email,users.id, kelas.nama as kelas')
            ->join('kelas', 'kelas.id=users.kelas_id', 'left')
            ->where('kelas_id', $id)
            ->findAll();
---
SELECT `users`.`nama`, `users`.`email`, `users`.`id`, `kelas`.`nama` as `kelas`
FROM `users`
LEFT JOIN `kelas` ON `kelas`.`id`=`users`.`kelas_id`
WHERE `kelas_id` = '1'